setwd("D:/limworkspace/R_Statistics/Ch_09_상관과 회귀")

# Section 2. 회귀분석 

# 1. 독립변수(설명변수)와 종속변수(반응변수) -------------------------------------------------------

# 종속변수 : 변수간의 관계에서 다른 변수에 의해 영향을 받아 그 값이 결정되는 변수
# 독립변수 : 영향을 미치는 변수

# 원인과 결과 관계를 뜻하는 인과관계는 상관관계처럼 계산을 통해 구하는 것이 아닌,
# 주의 깊은 자료의 관찰을 통해 얻을 수 있는 관계다.
# 다시말해 사회현상은 관찰연구(Observational study)를 많이 사용하는데 이 경우에는 실험을 통제할 수 없음을 인정하고,
# 사전지식과 사회에 대한 깊은 통찰력을 가져야 한다. 
# 즉, 연구를 진행하기 앞서 다음과 같은 고민을 가져야 할 필요가 있다.

# (1) 두 변수의 연관성 : 미세먼지와 교통사고 간의 연관을 따진느 것이 타당한지 살펴본다
# (2) 원인과 결과에 대한 고민 : 뒤바뀐 인과관계는 아닌지 살펴본다
# (3) 제3의 요인 : 종속변수에 또 다른 요인이 영향을 주지는 않는지 고려해볼 필요가 있다. 


# 2. 단순선형회귀분석 (독립변수가 1개 )-------------------------------------------------------------





